



/**
 * Данная бибилиотека содержит классы и константы для работы с графикой приложения


 * Область имен:
 * ---------
 *     * gui - Данная область содержит классы и константы для работы с графикой приложения
 * 
 * 
 * Константы:
 * ---------
 * 
 * 
 * Классы:
 * ------
 *     * GUI - Данный класс необходим для работы с графикой приложения
 * 
 * 
*/


#pragma once

/**
 * @brief 
 * Данная область имен необходимо чтобы хранить реализацию блока работы с графическим интерфейсом приложения
*/
namespace gui{
/**
 * @brief 
 * Данный класс необходим для работы с графическим интерфейсом приложения
*/
class GUI;

}


// Указываем файл с реализацией
#include "GUI.cpp"