



/**
 * Данная бибилиотека содержит классы и константы для работы с курсами для приложения


 * Область имен:
 * ---------
 *     * courses - Данная область содержит классы и константы для работы с курсами для приложения
 * 
 * 
 * Константы:
 * ---------
 * 
 * 
 * Классы:
 * ------
 *     * Courses - Данный класс необходим для работы с курсами для приложения
 * 
 * 
*/


#pragma once

/**
 * @brief 
 * Данная область имен необходимо чтобы хранить реализацию блока работы с файлами
*/
namespace courses{
/**
 * @brief 
 * Данный класс необходим для работы с файлами/курсами 
*/
class Courses;

}


// Указываем файл с реализацией
#include "courses.cpp"